app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @book_new = Book.new
    @books = Book.all

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ooo"], ["body", "qqq\r\n"], ["user_id", 2], ["created_at", "2020-08-10 05:09:36.949958"], ["updated_at", "2020-08-10 05:09:36.949958"]]
SELECT "books".* FROM "books"
---
  def create
    @book_new = Book.new(book_params)
    @book_new.user_id = current_user.id
    if @book_new.save
      redirect_to book_path(@book_new), notice: "You have created book successfully."
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
    @user = current_user
    @book_new = Book.new
    @book = Book.find(params[:id])